const emergency = [
  '地震', '津波', '震度', '噴火', 'テロ', '暗殺',
  '洪水', '水害', '氾濫', '決壊', '豪雨', '落雷',
  '寒波', '降雪', '積雪', '障害', '停電', '断水', '原子',
  '買収', '合併', '上場', '株価', '為替',
  '大阪符', '大阪市', '大阪で', '大阪に', '関西', '西日本',
  '未曾有', '歴史的', '記録的', '壊滅的',
  '日経平均', '緊急事態', '緊急速報', '通信障害', '好適環境水',
  '大災害', '大規模', '大規模災害',
  'ライフライン', 'インフラ',
];

const uncertain = [
  'か$', 'も$', 'へ$', '今$', '訳$', 'とは$', '\\?', '思う', '語る', '明かす',
  'らぬ', 'らず', 'れる', 'れぬ', 'ぶり', 'なぜ', '違う', 'しない',
  '誤情報', '誤報道', '可能性', '想定', '推定', '構想', '計画',
  '予定', '予報', '注意',
];

const sports = [
  'スポーツ', '野球', 'サッカー', 'バスケ', 'バレー', '卓球', '柔道', 'フェンシング',
  '剣道', 'ボクシング', 'カーリング', 'テニス', 'ラグビー', 'マラソン', '水泳', '陸上',
  'ソフトボール', 'バドミントン', 'ゴルフ', '格闘技', 'スピーチ', 'クラブ',
  '甲子園', 'リベンジ', 'ドラマ', 'リスク', 'リタイア', 'ヒント', 'ヒット', 'エラー',
  'イチロー', '大谷',
  '引退', '契約', '入団', '退団', '会見', '巨人', '走者', '得点', '失点', '打者',
  '合意', '速球', '球場', '勝負', '前半', '後半', '中盤', '観客', '大会', '点差',
  '中断', '試合', '選手', '球団', '審議', '審判', '三振', '降板', '登板', '表彰',
  '応援', '守護', '守備', '先攻', '後攻', '満塁', '苦戦', '連続', '強化', '交代',
  '攻撃', '防衛', '死球', '逆転', '始球', '選抜', '完投', '投手', '凱旋', '戦略',
  '先制', '球宴', '退部', '応援', '故障', '負傷', '怪我', '入場', '出場', '回復',
  '棄権', '敗北', '勝利', '負け', '勝ち', '優勝', '連携', '王手', '打撃', '打球',
  '監督', '解説', '判定', '好調', '不調', '敗戦', '敗退', '強敵', '難敵',
  '中止', '延期', '調整', '更新', '先発',
];

const talent = [
  '芸能', 'エンタメ', 'エンターテインメント', 'エンターテイメント',
  'タレント', '芸能人', '俳優', '声優', '歌手', 'ミュージシャン',
  '記事', '記者', '報道', '委員', '辞退', '発表', '公表', '披露', '登場',
  '人気', '話題', '入国', '出国', '到着', '帰国', '復帰', '謹慎', '処分',
  '事実', '確認', '真相', '用意', '準備', '反響', '反感', '釈明', '主演',
  '活動', '活発', '評判', '好評', '改名', '発言', '公演',
  '記憶', '資料',
  'ジュニア', 'コラボ',
];

const politics = [
  'マニフェスト', '政治', '参議院', '衆議院', '不信任', '決議案', '議会',
  '石破', '小泉',
  '辞意', '汚職', '代表', '非難', '表明', '棄却', '対策', '懸念',
  '選挙', '投票', '支持', '先行', '幹事', '公明', '幹部', '演説',
  '責任', '決意', '決断', '決定', '未定', '会談', '会議', '辞職', '辞任',
  '首相', '参院', '長官', '懲戒', '参政', '当選', '落選', '警護', '警備',
  '議員', '知事', '訪問', '参拝', '慰問', '着任', '離任', '撤回',
  '断念', '解散', '連立', '任期', '自民', '半数', '議席', '視察', '慰安',
  '野党', '結束', '与党', '行政', '社民', '政党', '方針', '維持', '見通',
  '大臣', '退任', '更迭', '検察', '制度', '政府', '政策', '政権',
  '万票', '得票', '局長',
];

const international = [
  '北朝鮮', '中国', '韓国', 'ウクライナ', 'ロシア', 'ガザ', 'トランプ',
  '支援', '空爆', '兵士', '撤退', '貿易', '関税', '提携', '抗議',
  '安保', '衝突', '反発', '反逆', '交渉', '停戦', '進展', '国境',
  '脱退', '廃止', '封鎖', '解禁', '国防', '悪化', '激化',
  '捕虜', '人質', '開放', '関係', '戦争', '遺族', '歴史', '来日',
];

const life = [
  '余命', '妊婦', '育児', '不妊', '衰退', '意味',
  '闘病', '昏睡', '死亡', '急逝', '危篤', '死去', '追悼', '搬送',
  '入院', '退院', '病院', '医院', '妊娠', '出産',
  '病気', '病状', '重体', '容態', '重症',
  '結婚', '離婚', '再婚', '祝儀', '祝福', '冥福',
  '孤独', '孤立', '疾患', '良性', '亡者',
];

const human = [
  '個人', '兄弟', '姉妹', '親子', '母子', '息子', '子供', '女児',
  '家庭', '家族', '一家', '婚活', '夫妻', '夫婦', '父親', '母親',
  '依存', '男性', '女性', '単身', '独身', '全員', '人間', '交際',
  '先輩', '後輩', '忖度', '猛者', '高齢', '長者', '親方', '児童',
  '故郷', '生徒', '介護', '従業員',
];

const natural = [
  '熱中', '真夏', '猛暑', '酷暑', '残暑', '四季', '一年', '半年',
  '崩落', '大量', '発生', '多発', '急増', '全然', '自然', '珍事',
  '連日', '中旬', '中間', '期末', '危惧', '時間', '時間',
  '悲し', '嬉し', '楽し', '笑い', '辛い', '幸い', '疑い', '恐れ', '恐れ',
  '悪い', '良い', '悼む', '薄れ', '暑さ', '並ぶ',
];

const regal = [
  '期限', '無罪', '有罪', '報告', '調査', '逃亡', '逃走', '暴力', '暴言',
  '加害', '被害', '謝罪', '事故', '後悔', '密輸', '密売', '殺人', '殺害',
  '襲撃', '相談', '思惑', '誘拐', '容疑', '異議', '申請', '制裁', '疑惑',
  '賠償', '申告', '証言', '横領', '着服', '免許', '詐称', '禁止', '遺憾',
  '判決', '論点', '争点', '爆発', '破損', '出頭', '拒否', '被告', '原告',
  '裁判', '猶予', '憲法', '起訴', '訴訟', '提訴', '再審', '請求', '要求',
  '不明', '透明', '強制', '執行', '迷惑', '騒音', '不倫', '不貞', '不審',
  '虚偽', '射殺', '特定', '断定', '確定', '指紋', '反論', '強殺', '刺殺',
  '薬害', '暴行', '侵入', '書類', '送検', '供述', '死刑', '処刑', '無期',
  '拘束', '確保', '捕獲', '犯罪', '通報',
];

const concepts = [
  '苦労', '苦言', '負担', '破産', '保護', '愛護', '体験', '連休', '関越', '渋滞',
  '予想', '理由', '苦難', '苦境', '今後', '安全', '危険', '過去', '未来', '予言',
  '帰宅', '背景', '悪夢', '導入', '運休', '面会', '面談', '対談', '応募',
  '増量', '制限', '賛成', '反対', '卒業', '再燃', '接近', '兆候', '前兆', '移住',
  '運転', '指示', '覚悟', '注文', '混乱', '困惑', '対応', '削除', '削減', '影響',
  '警戒', '苦悩', '努力', '天国', '地獄', '旅行', '減量', '疑問', '意向',
  '傾向', '恐怖', '絶望', '幸福', '感動', '優秀', '成金', '繁盛', '閉店', '移転',
  '倒産', '苦情', '殺到', '不安', '不安', '情報', '情報', '大気', '大気',
  '誤爆', '裏側', '流行', '会話', '報酬', '歓喜', '裏目', '歓声', '喝采', '祝賀',
  '作業', '作業',
];

const other = [
  '東京', '東京', '23区', '関東', '都心', '都内', '都市', '民間', '役員', '業者',
  '要請', '遅延', '最悪', '混雑', '通過', '年度', '公開', '意識', '行方',
  '分間', '交差', '抵抗', '要因', '投稿', '拡散', '地元',
  '着陸', '欠測', '運用', '開始', '価格', '欠航',
  '来年', '発売', '長蛇', '感情', '見解', '使命', '紹介', '文化',
  '上昇', '減少',
];

export const detail = {
  uncertain,
  sports,
  talent,
  politics,
  international,
  life,
  human,
  concepts,
  natural,
  regal,
  other,
};

export const dataset = {
  emergency,
  noisy: Object.values(detail).flat(),
};

export const extractKeywords = title => {
  return {
    emergency: dataset.emergency.filter(em => title.match(em)),
    noisy: dataset.noisy.filter(text => title.match(new RegExp(text))),
  };
};

export default dataset;
