const emergency = [
  '地震', '津波', '震度', '噴火', 'テロ', '緊急事態', '緊急速報',
  '洪水', '水害', '氾濫', '決壊', '豪雨', '落雷', '未曾有',
  '大阪', '好適環境水', '寒波', '障害', '停電', '断水', '大災害',
  '買収', '合併', '上場', '株価', '為替', '原子', '歴史的', '記録的',
  '日経平均',
];

const uncertain = [
  'か$', 'も$', 'へ$', '今$', '思う', '語る', '明かす', 'しない',
  'らぬ', 'らず', 'ぶり', '違う', '\\?',
];

const sports = [
  'スポーツ', '野球', 'サッカー', 'バスケ', 'バレー', '卓球', '柔道', 'フェンシング',
  '剣道', 'ボクシング', 'カーリング', 'テニス', 'ラグビー', 'マラソン', '水泳', '陸上',
  'ソフトボール', 'バドミントン', 'ゴルフ', '格闘技', 'リタイア',
  '引退', '契約', '入団', '退団', '会見', '巨人', '走者', '得点', '失点', '打者', '点差',
  '大会', '甲子園', '合意', '速球', '球場', '勝負', '前半', '後半', '中盤', '観客',
  'リベンジ', '中断', '試合', '選手', '球団', '大谷', '審議', '審判', '強化', '応援',
  'ドラマ', '守護', '守備', '先攻', '後攻', '満塁', '苦戦', '三振', '連続',
  '攻撃', '防衛', '死球', '逆転', '始球', '選抜', '完投', '投手', '降板', '登板',
  '先制', '球宴', '退部', '応援', '故障', '負傷', '怪我', '凱旋', '出場', '敗北',
  '負け', '優勝', '勝利',
];

const human = [
  '兄弟', '姉妹', '親子', '母子', '息子', '母親', '独身',
  '苦労', '負担', '余命', '準備', '到着', '出国', '帰国', '帰宅', '依存',
  '男性', '暴力', '加害', '被害', '復帰', '謹慎',
  '破産', '保護', '愛護', '体験', '予言', '連休', '関越', '渋滞', '予想',
  '理由', '苦難', '苦境', '不妊', '相談', '思惑', '今後',
  '密輸', '密売', '殺人', '殺害', '安全', '危険', '過去', '未来', '評判',
  '遺憾', '先輩', '後輩', '忖度', '時間', '被告', '登場', '背景', '悪夢',
  '面会', '面談', '襲撃', '誘拐', '主演', '応募',
  '疑い', '容疑', '賠償', '申告', '申請', '増量', '国防', '異議', '絶望',
  '改名', '詐称', '出頭', '拒否', '禁止', '発言', '導入', '運休',
  '免許', '制限', '賛成', '反対', '婚活', '卒業', '再燃', '接近', '恐れ',
  '前兆', '移住', '衝突', '運転', '指示', '処分', '覚悟', '注文', '開放',
  '混乱', '困惑', '対応', '削除', '削減', '影響', '警戒', '回復', 'ヒント',
  '裏目', '昏睡', '死亡', '急逝', '疑惑', '不安', '努力', '天国', '地獄',
  '苦悩', '死去', '追悼', '搬送', '入院', '退院', '病院', '病気', '医院',
  '妊娠', '出産', '結婚', '離婚', '再婚', '孤独', '孤立', '疑問', '意向',
  '歓喜', '証言', '旅行', '逃亡', '逃走', '減量', '良性', '疾患',
  '後悔', '恐怖', '感動', '謝罪', '事故', '優秀', '横領', '着服',
  '裏側', '祝儀', '祝福', '冥福', '披露', '人気', '話題', '流行', '会話',
  '事実', '確認', '真相', '用意', '反響', '繁盛', '閉店', '倒産', '誤爆',
];

const political = [
  '北朝鮮', '中国', '韓国', 'ウクライナ', 'ロシア', 'ガザ', 'トランプ',
  '空爆', '兵士', 'マニフェスト', '代表', '虚偽', '撤退', '辞意',
  '発表', '公表', '非難', '表明', '棄却', '貿易', '関税',
  '選挙', '投票', '支持', '先行', '幹事', '公明', '幹部',
  '責任', '決意', '決断', '決定', '未定', '抗議', '汚職',
  '会談', '会議', '辞職', '辞任', '再審', '警護', '警備',
  '首相', '参議院', '参院', '衆議院', '長官',
  '裁判', '猶予', '憲法', '議員', '知事', '訪問', '参拝', '慰問', '安保',
  '悪化', '激化', '不審', '参政', '当選', '落選',
  '棄権', '断念', '解散', '連立', '任期', '自民', '半数', '議席',
  '野党', '結束', '与党', '行政', '社民', '政党', '方針', '維持', '見通',
  '大臣', '退任', '更迭', '交渉', '停戦', '進展', '国境', '検察',
  '暴落', '脱退', '廃止', '封鎖', '解禁', '反発',
  '起訴', '訴訟', '制度', '釈明', '制裁', '提訴',
  '記事', '記者', '報道',
];

const natural = [
  '熱中', '真夏', '猛暑', '酷暑', '残暑', '四季',
  '崩落', '大量', '発生', '多発',
];

const other = [
  '地元', '闘病', '対談',
  '東京', '関東', '都心', '都市', '悲しい', '嬉しい', '民間', '役員',
  '危篤', '不明', '報告', '調査', '監督', '解説', '判定', '要請',
  '無罪', '有罪', '判決', '論点', 'リスク', '期限',
  '最高', '最悪', '混雑', '通過', '全然', '珍事', '連日', '中旬',
  '透明', '牛乳', '分間', '万票', '得票', '交差', '業者',
  '要因', '着陸', '欠測', '運用', '開始', '価格', '抵抗', '委員',
  '爆発', '破損', '遅延', '上昇', '減少', '欠航',
];

const deny = [
  ...uncertain,
  ...sports,
  ...human,
  ...political,
  ...natural,
  ...other,
];

module.exports = {
  dataset: {
    emergency,
    deny,
  },
};
